{
    "states": [
        "isInUndefined",
        "isInBedRoom",
        "isInEmptyRoom",
        "isInDiningRoom",
        "isInPantryRoom",
        "inFOVOfRobot",
        "isInGarage",
        "isInBathroom",
        "inHandOfRobot",
        "isInPlayRoom",
        "isInHomeOffice",
        "isInLibrary",
        "isInStaircase",
        "isInKitchen",
        "isInLivingRoom",
        "isInExerciseRoom",
        "isInCorridor",
        "inReachOfRobot",
        "isInAuditorium",
        "isInTelevisionRoom",
        "isInLobby",
        "isInBalcony",
        "isInStorageRoom",
        "isInChildsRoom",
        "isInCloset",
        "inSameRoomAsRobot",
        "isInUtilityRoom",
        "frozen",
        "inside",
        "nextto",
        "touching",
        "dusty",
        "soaked",
        "under",
        "toggledon",
        "sliced",
        "burnt",
        "ontop",
        "cooked",
        "onfloor",
        "stained",
        "open",
        "holds_rh",
        "holds_lh"
    ],
    "actions": [
        "navigate_to",
        "left_grasp",
        "right_grasp",
        "left_place_ontop",
        "right_place_ontop",
        "left_place_inside",
        "right_place_inside",
        "right_release",
        "left_release",
        "open",
        "close",
        "burn",
        "cook",
        "clean",
        "freeze",
        "unfreeze",
        "slice",
        "soak",
        "dry",
        "stain",
        "toggle_on",
        "toggle_off",
        "unclean",
        "left_place_nextto",
        "right_place_nextto",
        "left_transfer_contents_inside",
        "right_transfer_contents_inside",
        "left_transfer_contents_ontop",
        "right_transfer_contents_ontop",
        "left_place_nextto_ontop",
        "right_place_nextto_ontop",
        "left_place_under",
        "right_place_under"
    ],
    "action_param": {
        "navigate_to": 1,
        "left_grasp": 1,
        "right_grasp": 1,
        "left_place_ontop": 1,
        "right_place_ontop": 1,
        "left_place_inside": 1,
        "right_place_inside": 1,
        "right_release": 1,
        "left_release": 1,
        "open": 1,
        "close": 1,
        "cook": 1,
        "clean": 1,
        "freeze": 1,
        "unfreeze": 1,
        "slice": 1,
        "soak": 1,
        "dry": 1,
        "toggle_on": 1,
        "toggle_off": 1,
        "left_place_nextto": 1,
        "right_place_nextto": 1,
        "left_transfer_contents_inside": 1,
        "right_transfer_contents_inside": 1,
        "left_transfer_contents_ontop": 1,
        "right_transfer_contents_ontop": 1,
        "left_place_nextto_ontop": 2,
        "right_place_nextto_ontop": 2,
        "left_place_under": 1,
        "right_place_under": 1
    },
    "state_param": {
        "isInUndefined": 1,
        "isInBedRoom": 1,
        "isInEmptyRoom": 1,
        "isInDiningRoom": 1,
        "isInPantryRoom": 1,
        "inFOVOfRobot": 1,
        "isInGarage": 1,
        "isInBathroom": 1,
        "inHandOfRobot": 1,
        "isInPlayRoom": 1,
        "isInHomeOffice": 1,
        "isInLibrary": 1,
        "isInStaircase": 1,
        "isInKitchen": 1,
        "isInLivingRoom": 1,
        "isInExerciseRoom": 1,
        "isInCorridor": 1,
        "inReachOfRobot": 1,
        "isInAuditorium": 1,
        "isInTelevisionRoom": 1,
        "isInLobby": 1,
        "isInBalcony": 1,
        "isInStorageRoom": 1,
        "isInChildsRoom": 1,
        "isInCloset": 1,
        "inSameRoomAsRobot": 1,
        "isInUtilityRoom": 1,
        "frozen": 1,
        "inside": 2,
        "nextto": 2,
        "touching": 2,
        "dusty": 1,
        "soaked": 1,
        "under": 2,
        "toggledon": 1,
        "sliced": 1,
        "burnt": 1,
        "ontop": 2,
        "cooked": 1,
        "onfloor": 2,
        "stained": 1,
        "open": 1,
        "holds_rh": 1,
        "holds_lh": 1
    }
}